pong-to-rich/k6/refresh-load-test/RDB-vu500-01.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)

INFO[0006] setup 완료: 100개 refreshToken 수집                source=console


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<200' p(95)=533.09ms
    ✗ 'p(99)<400' p(99)=609.44ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_waiting
    ✗ 'p(95)<150' p(95)=532.33ms


  █ TOTAL RESULTS 

    checks_total.......: 87948   2431.795073/s
    checks_succeeded...: 100.00% 87948 out of 87948
    checks_failed......: 0.00%   0 out of 87948

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00% 0 out of 43974
    refresh_duration...............: avg=240.75ms min=65.19ms  med=249.08ms max=728.18ms p(90)=402.92ms p(95)=533.24ms

    HTTP
    http_req_duration..............: avg=240.34ms min=55.69ms  med=245.98ms max=728.18ms p(90)=402.6ms  p(95)=533.09ms
      { expected_response:true }...: avg=240.34ms min=55.69ms  med=245.98ms max=728.18ms p(90)=402.6ms  p(95)=533.09ms
    http_req_failed................: 0.00% 0 out of 44074
    http_reqs......................: 44074 1218.662574/s

    EXECUTION
    iteration_duration.............: avg=342.07ms min=173.33ms med=353.68ms max=828.39ms p(90)=505.54ms p(95)=634.27ms
    iterations.....................: 43974 1215.897536/s
    vus............................: 500   min=0          max=500
    vus_max........................: 500   min=500        max=500

    NETWORK
    data_received..................: 34 MB 937 kB/s
    data_sent......................: 16 MB 436 kB/s



running (0m36.2s), 000/500 VUs, 43974 complete and 0 interrupted iterations
default ✓ [======================================] 500 VUs  30s
ERRO[0036] thresholds on metrics 'http_req_duration, http_req_waiting' have been crossed