pong-to-rich/k6/refresh-load-test/RDB-vu500-03.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)

INFO[0006] setup 완료: 100개 refreshToken 수집                source=console


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<200' p(95)=572.68ms
    ✗ 'p(99)<400' p(99)=679.13ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_waiting
    ✗ 'p(95)<150' p(95)=572.29ms


  █ TOTAL RESULTS 

    checks_total.......: 81940   2256.065603/s
    checks_succeeded...: 100.00% 81940 out of 81940
    checks_failed......: 0.00%   0 out of 81940

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00% 0 out of 40970
    refresh_duration...............: avg=265.28ms min=11.04ms  med=267.75ms max=815.94ms p(90)=461.85ms p(95)=572.86ms

    HTTP
    http_req_duration..............: avg=264.78ms min=11.04ms  med=262.21ms max=815.94ms p(90)=461.52ms p(95)=572.68ms
      { expected_response:true }...: avg=264.78ms min=11.04ms  med=262.21ms max=815.94ms p(90)=461.52ms p(95)=572.68ms
    http_req_failed................: 0.00% 0 out of 41070
    http_reqs......................: 41070 1130.786115/s

    EXECUTION
    iteration_duration.............: avg=366.92ms min=177.12ms med=372.77ms max=1.03s    p(90)=563.77ms p(95)=674.36ms
    iterations.....................: 40970 1128.032801/s
    vus............................: 500   min=0          max=500
    vus_max........................: 500   min=500        max=500

    NETWORK
    data_received..................: 32 MB 870 kB/s
    data_sent......................: 15 MB 404 kB/s



running (0m36.3s), 000/500 VUs, 40970 complete and 0 interrupted iterations
default ✓ [======================================] 500 VUs  30s
ERRO[0036] thresholds on metrics 'http_req_duration, http_req_waiting' have been crossed