pong-to-rich/k6/refresh-load-test/Redis-vu500-00.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)

INFO[0007] setup 완료: 100개 refreshToken 수집                source=console


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<200' p(95)=1.55s
    ✗ 'p(99)<400' p(99)=2.28s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_waiting
    ✗ 'p(95)<150' p(95)=1.54s


  █ TOTAL RESULTS 

    checks_total.......: 39372   1033.59791/s
    checks_succeeded...: 100.00% 39372 out of 39372
    checks_failed......: 0.00%   0 out of 39372

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00%  0 out of 19686
    refresh_duration...............: avg=664.28ms min=179.7ms  med=621.8ms  max=3.21s p(90)=1.19s p(95)=1.55s

    HTTP
    http_req_duration..............: avg=661.31ms min=60.32ms  med=619.62ms max=3.21s p(90)=1.19s p(95)=1.55s
      { expected_response:true }...: avg=661.31ms min=60.32ms  med=619.62ms max=3.21s p(90)=1.19s p(95)=1.55s
    http_req_failed................: 0.00%  0 out of 19786
    http_reqs......................: 19786  519.424166/s

    EXECUTION
    iteration_duration.............: avg=766.91ms min=279.96ms med=723.28ms max=3.41s p(90)=1.3s  p(95)=1.66s
    iterations.....................: 19686  516.798955/s
    vus............................: 294    min=0          max=500
    vus_max........................: 500    min=500        max=500

    NETWORK
    data_received..................: 15 MB  399 kB/s
    data_sent......................: 7.1 MB 186 kB/s



running (0m38.1s), 000/500 VUs, 19686 complete and 0 interrupted iterations
default ✓ [======================================] 500 VUs  30s
ERRO[0038] thresholds on metrics 'http_req_duration, http_req_waiting' have been crossed