pong-to-rich/k6/refresh-load-test/Redis-vu500-01.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)

INFO[0006] setup 완료: 100개 refreshToken 수집                source=console


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<200' p(95)=816.1ms
    ✗ 'p(99)<400' p(99)=1.01s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_waiting
    ✗ 'p(95)<150' p(95)=815.63ms


  █ TOTAL RESULTS 

    checks_total.......: 60880   1677.730024/s
    checks_succeeded...: 100.00% 60880 out of 60880
    checks_failed......: 0.00%   0 out of 60880

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00% 0 out of 30440
    refresh_duration...............: avg=392.94ms min=78.63ms  med=326.02ms max=1.3s p(90)=693.34ms p(95)=816.48ms

    HTTP
    http_req_duration..............: avg=391.84ms min=55.32ms  med=322.03ms max=1.3s p(90)=692.58ms p(95)=816.1ms 
      { expected_response:true }...: avg=391.84ms min=55.32ms  med=322.03ms max=1.3s p(90)=692.58ms p(95)=816.1ms 
    http_req_failed................: 0.00% 0 out of 30540
    http_reqs......................: 30540 841.62081/s

    EXECUTION
    iteration_duration.............: avg=494.66ms min=209.38ms med=433.17ms max=1.4s p(90)=796.86ms p(95)=917.49ms
    iterations.....................: 30440 838.865012/s
    vus............................: 500   min=0          max=500
    vus_max........................: 500   min=500        max=500

    NETWORK
    data_received..................: 24 MB 647 kB/s
    data_sent......................: 11 MB 301 kB/s



running (0m36.3s), 000/500 VUs, 30440 complete and 0 interrupted iterations
default ✓ [======================================] 500 VUs  30s
ERRO[0036] thresholds on metrics 'http_req_duration, http_req_waiting' have been crossed