pong-to-rich/k6/refresh-load-test/Redis-vu500-02.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)

INFO[0006] setup 완료: 100개 refreshToken 수집                source=console


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<200' p(95)=549.11ms
    ✗ 'p(99)<400' p(99)=701.4ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_waiting
    ✗ 'p(95)<150' p(95)=548.31ms


  █ TOTAL RESULTS 

    checks_total.......: 85186   2353.431143/s
    checks_succeeded...: 100.00% 85186 out of 85186
    checks_failed......: 0.00%   0 out of 85186

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00% 0 out of 42593
    refresh_duration...............: avg=250.83ms min=53.79ms  med=188.31ms max=866.69ms p(90)=453.42ms p(95)=549.51ms

    HTTP
    http_req_duration..............: avg=250.39ms min=53.79ms  med=187ms    max=866.69ms p(90)=453.22ms p(95)=549.11ms
      { expected_response:true }...: avg=250.39ms min=53.79ms  med=187ms    max=866.69ms p(90)=453.22ms p(95)=549.11ms
    http_req_failed................: 0.00% 0 out of 42693
    http_reqs......................: 42693 1179.478269/s

    EXECUTION
    iteration_duration.............: avg=352.72ms min=154.32ms med=293.57ms max=1.07s    p(90)=554.87ms p(95)=654.13ms
    iterations.....................: 42593 1176.715572/s
    vus............................: 500   min=0          max=500
    vus_max........................: 500   min=500        max=500

    NETWORK
    data_received..................: 33 MB 907 kB/s
    data_sent......................: 15 MB 422 kB/s



running (0m36.2s), 000/500 VUs, 42593 complete and 0 interrupted iterations
default ✓ [======================================] 500 VUs  30s
ERRO[0036] thresholds on metrics 'http_req_duration, http_req_waiting' have been crossed